0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inflow
    {
	type            zeroGradient;
    }
    
    outflow
    {
	type   		zeroGradient;
    }
    
    bwall
    {
	type        fixedGradient;
    	gradient    uniform 10000;
    }
   
    front
    {
	type            wedge;
    }

    back
    {
	type            wedge;
    }
    
    axis
    {
	type            empty;
    }
}


// ************************************************************************* //
