constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inflow
    {
        type            patch;
        nFaces          50;
        startFace       19750;
    }
    outflow
    {
        type            patch;
        nFaces          50;
        startFace       19800;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10000;
        startFace       19850;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          10000;
        startFace       29850;
    }
    bwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       39850;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       40050;
    }
)

// ************************************************************************* //
