system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.000000 0.000000 0.000000)
    (0.000087 0.004999 0.000000)
    (-0.000087 0.004999 0.000000)
    (0.000000 0.000000 0.120000)
    (0.000087 0.004999 0.120000)
    (-0.000087 0.004999 0.120000)
);

edges
(
	arc 1 2 (0.000000 0.005000 0.000000)
	arc 4 5 (0.000000 0.005000 0.120000)
);

blocks
(
    hex (0 0 1 2 3 3 4 5) (1 50 200) simpleGrading (1 0.5 1)
);

boundary
(
    inflow
    {
        type patch;
        faces
        (
            (0 0 2 1)
        );
    }

    outflow
    {
        type patch;
        faces
        (
            (3 4 5 3)
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0 1 4 3)
        );
    }
    
    back
    {
        type wedge;
        faces
        (
            (3 5 2 0)
        );
    }

    bwall
    {
        type wall;
        faces
        (
            (4 1 2 5)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }
);

mergePatchPairs
(
);
